export const navbarLinks = [
  {
    title: "الرئيسية",
    href: "/"
  },
  {
    title: "من نحن",
    href: "/about"
  },
  {
    title: "رسالتنا",
    href: "/mission"
  },
  {
    title: "رؤيتنا",
    href: "/vision"
  },
  {
    title: "الاستثمار",
    dropdown: true,
    items: [
      {
        title: "فلسفتنا الإستثمارية",
        href: "/investment/philosophy"
      },
      {
        title: "مجالات الإستثمار",
        href: "/investment/areas"
      },
      {
        title: "لماذا حنكة",
        href: "/investment/why-henka"
      }
    ]
  },
  {
    title: "تواصل معنا",
    href: "/contact"
  }
];


export const philosophy = {
  title: "فلسفتنــا الاستثماريــة",
  intro: "في “حنكة”، نُدير الاستثمار كما نُدير حياتنا:",
  principles: [
    "بالقِيَم : نُؤمن أن المال يجب أن يُدار وفق مبادئ، لا مزاج السوق فقط.",
    "بالبُعد الطويل : نركز على الاستدامة لا المكاسب المؤقتة.",
    "برؤية واضحة: نخطو بثبات نحو أهدافنا",
    "بالعقل المؤسسي : نُوازن بين مرونة العائلة وانضباط المؤسسات."
  ],
  evaluation: "نقيّم الفرص من كل زاوية: الجدوى، الأثر، التوقيت، والتكامل مع محفظتنا ورؤيتنا."
};

export const investment_areas = {
  areas: [
    {
      name: "التطوير العقاري",
      details: "استثمارات طويلة الأجل في مشاريع عقارية مختارة، تركّز على الجودة، والموقع، والقيمة المستدامة."
    },
    {
      name: "التقنية المالية (FinTech)",
      details: "نستثمر في حلول الدفع، والتقنيات البنكية، والمنصات التي تعيد تعريف القطاع المالي."
    },
    {
      name: "الذكاء الاصطناعي والتقنيات الناشئة",
      details: "ندعم الشركات التي تستخدم التقنية لصناعة المستقبل، من التحول الرقمي إلى الأتمتة والتحليل الذكي."
    },

    {
      name: "الخدمات اللوجستية",
      details: "بخبرة عملية في هذا المجال، نُقيم وندعم المشاريع التي تبني مستقبل النقل والإمداد في المنطقة."
    },
    {
      name: "رأس المال الجريء والشركات الناشئة",
      details: "نُراهن على رواد الأعمال أصحاب الرؤية، ونبني علاقات طويلة معهم لا صفقات قصيرة الأجل."
    },
    {
      name: "الاستثمار الصناعي",
      details: "نُسهم في تطوير القطاع الصناعي المحلي من خلال دعم مشاريع تُضيف قيمة نوعية، وتعزز سلاسل التوريد."
    },
    {
      name: "الاستثمار السياحي",
      details: "نستثمر في مشاريع تعكس جمال وثقافة المملكة، وتقدّم تجارب سياحية مستدامة ومميزة."
    },
    {
      name: "الاستثمار الدولي",
      details: "ننظر للأسواق العالمية بعين استراتيجية، ونختار الفرص التي تتماشى مع رؤيتنا وتكمل محفظتنا."
    },
    {
      name: "أسواق المال",
      details: "ندير استثماراتنا في الأسواق المالية بأسلوب متزن، يراعي العوائد والاستقرار، وفق تحليل شامل وتقييم مستمر."
    },
  ]
};


export const why_henka = {
  points: [
    "خبرة عملية في ريادة الأعمال والأسواق المحلية والعالمية",
    "خصوصية وثقة في التعامل",
    "فلسفة متزنة تجمع بين الانضباط والمرونة",
    "تركيز على القيم العائلية والتوريث",
    "شراكات استراتيجية، وليست مجرد استثمارات مالية"
  ]
};
